---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SelectionFailures.NoElementSelected
source: html/076acc54-94ff-19e0-49ff-aec9c194fd5c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SelectionFailures.NoElementSelected Property

No element selected.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoElementSelected { get; }
```